app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("title", "ingredientes", "preparation", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "ingredientes" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["ingredientes", "eggs, tomatoes, salad"], ["updated_at", "2023-11-07 15:24:32.845079"], ["id", 1]]